dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/cy_capsense_control.c
/***************************************************************************//**
* \file cy_capsense_control.c
* \version 1.1
*
* \brief
* This file provides the source code to the Control module functions.
*
********************************************************************************
* \copyright
* Copyright 2018, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include <stddef.h>
#include "cy_syslib.h"
#include "cy_syspm.h"
#include "cy_csd.h"
#include "cy_capsense_common.h"
#include "cy_capsense_structure.h"
#include "cy_capsense_control.h"
#include "cy_capsense_processing.h"
#include "cy_capsense_filter.h"
#include "cy_capsense_sensing.h"
#include "cy_capsense_tuner.h"


/*******************************************************************************
* Function Name: Cy_CapSense_Init
****************************************************************************//**
*
* Captures the CSD HW block and configures it to default state. This function is
* called by the application program prior to calling any other function of the
* middleware.
*
* The following tasks are executed:
* 1. Capturing CSD HW block. If hardware is already in use, then the function
*    returns fail status and corresponding actions like releasing the CSD block
*    should be performed on the application level.
* 2. If HW block was captured the function configures it to the default state.
*
* The most common CapSense initialization process includes:
* 1. Calling this function Cy_CapSense_Init().
* 2. Initializing CSD HW block interrupts by enabling it and assigning
*    corresponding interrupt handler in main.c file.
* 3. Calling Cy_CapSense_Enable() function.
*
* When the middleware operation is stopped by the Cy_CapSense_DeInit()
* function, the Cy_CapSense_Init() function repeats an initialization
* process.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t
* generated by CapSense configuration tool. The structure contains both, CapSense
* configuration and internal data and it is used during whole CapSense operation.
*
* \return
* Returns the status of the initialization process. If CY_RET_SUCCESS is not
* received, some of the initialization fails, the middleware may not operate
* as expected, and repeating of initialization is required.
*
* \funcusage
* \snippet capsense\1.0\snippet\main.c snippet_Cy_CapSense_Initialization
* The 'cy_capsense_context' variable that is used as the parameter of the
* Cy_CapSense_Init() and Cy_CapSense_Enable() functions is declared in the
* cycfg_capsense.h file.
* The CapSense_ISR_cfg variable should be declared on the application
* layer according to the examples below:<br>
* For M0p core:<br>
* \snippet capsense\1.0\snippet\main.c snippet_m0p_capsense_interrupt_source_declaration
*
* For M4 core:
* \snippet capsense\1.0\snippet\main.c snippet_m4_capsense_interrupt_source_declaration
*
* The CapSense interrupt handler should be declared on the application layer
* according to example below:
* \snippet capsense\1.0\snippet\main.c snippet_Cy_CapSense_IntHandler
*
* The CapSense_HW defines the base address of the CSD HW block used. The definition is
* is placed in the cycfg_peripherals.h file.
*
*******************************************************************************/
cy_status Cy_CapSense_Init(cy_stc_capsense_context_t * context)
{
    cy_status result = CY_RET_BAD_PARAM;

    if (NULL != context)
    {
        result = Cy_CapSense_Restore(context);

        /* The 25us interval is required for settling analog part of the CSD HW block. */
        Cy_SysLib_DelayUs(CY_CAPSENSE_ANALOG_SETTLING_TIME_US);
    }

    return result;
}


/*******************************************************************************
* Function Name: Cy_CapSense_Enable
****************************************************************************//**
*
* Initializes the CapSense firmware modules. This function is called by the
* application program after Cy_CapSense_Init() function. The function requires
* CSD HW block interrupt to be correctly configured.
*
* The following are executed as part of the function:
* 1. Check CapSense configuration integrity.
* 2. Pre-calculate of internal register values to speed up operation.
* 3. Configure the hardware to perform capacitive sensing.
* 4. If SmartSense Auto-tuning is selected for the CSD Tuning mode in the
*    Basic tab, the auto-tuning algorithm is executed to set the optimal
*    values for the hardware parameters of the widgets/sensors.
* 5. Calibrate the sensors and find the optimal values for IDACs of each
*    widget/sensor, if the Enable IDAC auto-calibration is enabled in the
*    CSD Setting or CSX Setting tabs.
* 5. Perform scanning for all the sensors and initialize the baseline history.
* 6. If the firmware filters are enabled in the Advanced General tab, the
*    filter histories are also initialized.
*
* Any next call of this function repeats an initialization process except for
* data structure initialization. Therefore, it is possible to change the
* middleware configuration from the application program by writing registers
* to the data structure and calling this function again. This is also
* done inside the Cy_CapSense_RunTuner() function when a restart command
* is received.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the initialization process. If CY_RET_SUCCESS is not
* received, some of the initialization fails.
*
* \funcusage
* \snippet capsense\1.0\snippet\main.c snippet_Cy_CapSense_Initialization
* The 'cy_capsense_context' variable that is used as the parameter of the
* Cy_CapSense_Init() and Cy_CapSense_Enable() functions is declared in the
* cycfg_capsense.h file.
* The CapSense_ISR_cfg variable should be declared on the application
* layer according to the examples below:<br>
* For M0p core:<br>
* \snippet capsense\1.0\snippet\main.c snippet_m0p_capsense_interrupt_source_declaration
*
* For M4 core:
* \snippet capsense\1.0\snippet\main.c snippet_m4_capsense_interrupt_source_declaration
*
* The CapSense interrupt handler should be declared on the application layer
* according to example below:
* \snippet capsense\1.0\snippet\main.c snippet_Cy_CapSense_IntHandler
*
* The CapSense_HW defines the base address of the CSD HW block used. The definition is
* is placed in the cycfg_peripherals.h file.
*
*******************************************************************************/
cy_status Cy_CapSense_Enable(cy_stc_capsense_context_t * context)
{
    cy_status result;
    uint32_t cpuFreqMHz;
    uint32_t watchdogCounter;

    /* Approximate duration of Wait For Init loop */
    const uint32_t isBusyLoopDuration = 5uL;

    /* Wait For Init watchdog timeout in microseconds */
    const uint32_t isBusyWatchdogTimeUs = 1000000uL;

    /* Initialize CapSense modules */
    result = Cy_CapSense_Initialize(context);

    if(CY_RET_SUCCESS == result)
    {
        if (CY_CAPSENSE_CSD_SS_DIS != context->ptrCommonConfig->csdAutotuneEn)
        {
            result |= Cy_CapSense_SsAutoTune(context);
        }

        if ((CY_CAPSENSE_ENABLE == context->ptrCommonConfig->csdEn) &&
           (CY_CAPSENSE_CSD_SS_DIS == context->ptrCommonConfig->csdAutotuneEn) &&
           (CY_CAPSENSE_ENABLE == context->ptrCommonConfig->csdIdacAutocalEn))
        {
            result |= Cy_CapSense_CalibrateAllCsdWidgets(context);
        }

        if((CY_CAPSENSE_ENABLE == context->ptrCommonConfig->csxEn) &&
           (CY_CAPSENSE_ENABLE == context->ptrCommonConfig->csxIdacAutocalEn))
        {
            result |= Cy_CapSense_CalibrateAllCsxWidgets(context);
        }


        result |= Cy_CapSense_ScanAllWidgets(context);
        /* Init Watchdog Counter to prevent a hang */
        cpuFreqMHz = context->ptrCommonConfig->cpuClkHz / 1000000uL;
        watchdogCounter = Cy_CapSense_WatchdogCyclesNum(isBusyWatchdogTimeUs, cpuFreqMHz, isBusyLoopDuration);

        while(CY_CAPSENSE_NOT_BUSY != Cy_CapSense_IsBusy(context))
        {
            if(0uL == watchdogCounter)
            {
                break;
            }

            watchdogCounter--;
        }
    }

    Cy_CapSense_InitializeAllFilters(context);
    Cy_CapSense_InitializeAllBaselines(context);

    return result;
}


