dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/cy_capsense_control.c
/*******************************************************************************
* Function Name: Cy_CapSense_Initialize
****************************************************************************//**
*
* Initializes all sub-modules of the CapSense middleware.
*
* The initialization includes:
* - Data Structure - set the default middleware parameters based
*   on configuration.
* - Data Processing - resets the status all widgets.
* - Tuner - resets the tuner communication state.
* - Sensing - prepares CSD HW for operation.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
* \return
* Return CY_RET_SUCCESS if the initialization was successful.
*
*******************************************************************************/
cy_status Cy_CapSense_Initialize(cy_stc_capsense_context_t * context)
{
    cy_status result = CY_RET_INVALID_STATE;

    result = Cy_CapSense_CheckConfigIntegrity(context);
    if (CY_RET_SUCCESS == result)
    {
        /* The Tuner is initialized only once */
        if (CY_CAPSENSE_INIT_NEEDED == context->ptrCommonContext->initDone)
        {
            Cy_CapSense_TuInitialize(context);
            context->ptrCommonContext->initDone = CY_CAPSENSE_INIT_DONE;
        }

        Cy_CapSense_InitializeAllStatuses(context);
        result = Cy_CapSense_SsInitialize(context);
    }
    
    return (result);
}


/*******************************************************************************
* Function Name: Cy_CapSense_DeInit
****************************************************************************//**
*
* Stops the middleware operation.
*
* This function stops the middleware operation. No sensor scanning can be
* executed when the middleware is stopped. After it is stopped, the hardware block may
* be reconfigured by the application program for any other special usage. The
* middleware operation can be resumed by calling the Cy_CapSense_Init()
* function.
*
* This function is called when no scanning is in progress.
* I.e. Cy_CapSense_IsBusy() returns a non-busy status.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the stop process. If CY_RET_SUCCESS is not received,
* the stop process fails and retries may be required.
*
*******************************************************************************/
cy_status Cy_CapSense_DeInit(cy_stc_capsense_context_t * context)
{
    cy_status result = CY_RET_SUCCESS;

    if (CY_CSD_SUCCESS != Cy_CSD_DeInit(context->ptrCommonConfig->ptrCsdBase, CY_CSD_CAPSENSE_KEY, context->ptrCommonConfig->ptrCsdContext))
    {
        result = CY_RET_BAD_DATA;
    }
    else
    {
        context->ptrCommonContext->initDone = CY_CAPSENSE_INIT_NEEDED;
    }

    return (result);
}


/*******************************************************************************
* Function Name: Cy_CapSense_ProcessAllWidgets
****************************************************************************//**
*
* Performs full data processing of all enabled widgets.
*
* This function performs all data processes for all enabled widgets in the
* middleware. The following tasks are executed as part of processing all the
* widgets:
* 1. Apply raw count filters to the raw counts, if they are enabled.
* 2. Update the thresholds if the SmartSense Full Auto-Tuning is enabled.
* 3. Update the baselines and difference counts for all the sensors.
* 4. Update the sensor and widget status (on/off), update the centroid for
*    the sliders and the X/Y position for the touchpads.
*
* This function is called by an application program only after all the enabled
* widgets (and sensors) in the middleware are scanned. Calling this function
* multiple times without sensor scanning causes unexpected behavior.
*
* The disabled widgets are not processed by this function.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the processing operation. If CY_RET_SUCCESS is not received,
* the processing fails and retries may be required.
*
*******************************************************************************/
cy_status Cy_CapSense_ProcessAllWidgets(cy_stc_capsense_context_t * context)
{
    uint32_t wdIndex;
    cy_status result = CY_RET_SUCCESS;

    for (wdIndex = context->ptrCommonConfig->numWd; wdIndex-- > 0u;)
    {
        result |= Cy_CapSense_ProcessWidget(wdIndex, context);
    }
    return result;
}


/*******************************************************************************
* Function Name: Cy_CapSense_ProcessWidget
****************************************************************************//**
*
* Performs full data processing of the specified widget if it is enabled.
*
* This function performs exactly the same tasks as
* Cy_CapSense_ProcessAllWidgets(), but only for a specified widget. This
* function can be used along with the Cy_CapSense_SetupWidget() and
* Cy_CapSense_Scan() functions to scan and process data for a specific
* widget. This function is called only after all the sensors in the
* widgets are scanned. A disabled widget is not processed by this function.
*
* A pipeline scan method (i.e. during scanning of a widget performing processing
* of the previously scanned widget) can be implemented using this function and
* it may reduce the total execution time, increase the refresh rate and
* decrease the average power consumption.
*
* \param widgetId
* Specifies the ID number of a widget.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the widget processing:
* - CY_RET_SUCCESS       - The operation is successfully completed
* - CY_RET_BAD_PARAM     - The input parameter is invalid
* - CY_RET_INVALID_STATE - The specified widget is disabled
* - CY_RET_BAD_DATA      - The processing is failed
*
*******************************************************************************/
cy_status Cy_CapSense_ProcessWidget(uint32_t widgetId, cy_stc_capsense_context_t * context)
{
    cy_status result = CY_RET_BAD_PARAM;
    const cy_stc_capsense_widget_config_t * ptrWdCfg;

    /* Check parameter validity */
    if (widgetId < context->ptrCommonConfig->numWd)
    {
        ptrWdCfg = &context->ptrWdConfig[widgetId];
        
        /* Check widget enable status */
        if (0u == (ptrWdCfg->ptrWdContext->status & CY_CAPSENSE_WD_DISABLE_MASK))
        {
            switch(ptrWdCfg->senseMethod)
            {
                case (uint8_t)CY_CAPSENSE_SENSE_METHOD_CSD_E:
                    result = Cy_CapSense_DpProcessCsdWidgetRawCounts(ptrWdCfg, context);
                    Cy_CapSense_DpProcessCsdWidgetStatus(ptrWdCfg, context);
                    break;

                case (uint8_t)CY_CAPSENSE_SENSE_METHOD_CSX_E:
                    result = Cy_CapSense_DpProcessCsxWidgetRawCounts(ptrWdCfg, context);
                    Cy_CapSense_DpProcessCsxWidgetStatus(ptrWdCfg, context);
                    break;

            default:
                CY_ASSERT(0 != 0);
                break;
            }
        }
        else
        {
            result = CY_RET_INVALID_STATE;
        }
    }
    return result;
}


