dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/cy_capsense_control.c
/*******************************************************************************
* Function Name: Cy_CapSense_ProcessWidgetExt
****************************************************************************//**
*
* Performs customized data processing on the selected widget.
*
* This function performs data processes for the specified widget specified by
* the mode parameter. The execution order of the requested operations is from
* LSB to MSB of the mode parameter. For a different order, this function
* can be called multiple times with the required mode parameter.
*
* This function can be used with any of the available scan functions. This
* function is called only after all the sensors in the specified widget are
* scanned. Calling this function multiple times with the same mode without
* sensor scanning causes unexpected behavior. This function ignores the value
* of the wdgtEnable register.
*
* The CY_CAPSENSE_PROCESS_CALC_NOISE and CY_CAPSENSE_PROCESS_THRESHOLDS 
* flags are supported by the CSD sensing method only when SmartSense is enabled.
*
* The pipeline scan method (i.e. during scanning of a widget, processing
* of a previously scanned widget is performed) can be implemented using this
* function and it may reduce the total scan/process time, increase the refresh
* rate, and decrease the power consumption.
*
* \param widgetId
* Specifies the ID number of a widget.
*
* \param mode
* Specifies the type of widget processing to be executed for the
* specified widget:
* 1. Bits [31..6] - Reserved.
* 2. Bits [5..0]  - CY_CAPSENSE_PROCESS_ALL - Execute all the tasks.
* 3. Bit [5]      - CY_CAPSENSE_PROCESS_STATUS - Update the status 
*                   (on/off, centroid position).
* 4. Bit [4]      - CY_CAPSENSE_PROCESS_THRESHOLDS - Update the thresholds
*                   (only in CSD auto-tuning mode).
* 5. Bit [3]      - CY_CAPSENSE_PROCESS_CALC_NOISE - Calculate the noise 
*                   (only in CSD auto-tuning mode).
* 6. Bit [2]      - CY_CAPSENSE_PROCESS_DIFFCOUNTS - Update the difference counts.
* 7. Bit [1]      - CY_CAPSENSE_PROCESS_BASELINE - Update the baselines.
* 8. Bit [0]      - CY_CAPSENSE_PROCESS_FILTER - Run the firmware filters.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the widget processing operation:
* - CY_RET_SUCCESS      - The processing is successfully performed.
* - CY_RET_BAD_PARAM    - The input parameter is invalid.
* - CY_RET_BAD_DATA     - The processing failed.
*
*******************************************************************************/
cy_status Cy_CapSense_ProcessWidgetExt(
                uint32_t widgetId, 
                uint32_t mode, 
                cy_stc_capsense_context_t * context)
{
    uint32_t snsIndex;
    cy_status result = CY_RET_BAD_PARAM;
    uint32_t snsHistorySize;
    uint32_t freqChIndex;
    uint32_t freqChNumber;
    uint16_t * ptrHistoryCh;
    uint16_t * ptrHistorySns;
    uint8_t * ptrHistoryLowCh = NULL;
    uint8_t * ptrHistoryLowSns = NULL;
    cy_stc_capsense_sensor_context_t * ptrSnsCxtCh;
    cy_stc_capsense_sensor_context_t * ptrSnsCxtSns;
    const cy_stc_capsense_widget_config_t * ptrWdCfg;
    
    
    /* Check parameter validity */
    if (widgetId < context->ptrCommonConfig->numWd)
    {
        ptrWdCfg = &context->ptrWdConfig[widgetId];
        snsHistorySize = (uint32_t)ptrWdCfg->rawFilterConfig & CY_CAPSENSE_RC_FILTER_SNS_HISTORY_SIZE_MASK;
        freqChNumber = (CY_CAPSENSE_ENABLE == context->ptrCommonConfig->mfsEn) ? 3u : 1u;

        ptrSnsCxtCh = &ptrWdCfg->ptrSnsContext[0u];
        ptrHistoryCh = &ptrWdCfg->ptrRawFilterHistory[0u];
        if(CY_CAPSENSE_IIR_FILTER_PERFORMANCE == (ptrWdCfg->rawFilterConfig & CY_CAPSENSE_RC_FILTER_IIR_MODE_MASK))
        {
            ptrHistoryLowCh = &ptrWdCfg->ptrRawFilterHistoryLow[0u];
        }


        switch(ptrWdCfg->senseMethod)
        {
            case (uint8_t)CY_CAPSENSE_SENSE_METHOD_CSD_E:
                
                /* Run the desired processing for the all CSD widget sensors */
                for(freqChIndex = 0u; freqChIndex < freqChNumber; freqChIndex++)
                {
                    ptrSnsCxtSns = ptrSnsCxtCh;
                    ptrHistorySns = ptrHistoryCh;
                    ptrHistoryLowSns = ptrHistoryLowCh;
                    for (snsIndex = 0uL; snsIndex < ptrWdCfg->numSns; snsIndex++)
                    {                    
                        result = Cy_CapSense_DpProcessCsdSensorRawCountsExt(ptrWdCfg, ptrSnsCxtSns, ptrHistorySns, ptrHistoryLowSns, mode, context);

                        ptrSnsCxtSns++;
                        ptrHistorySns += snsHistorySize;
                        if(NULL != ptrHistoryLowSns)
                        {
                            ptrHistoryLowSns++;
                        }

                    }

                    ptrSnsCxtCh += context->ptrCommonConfig->numSns;
                    ptrHistoryCh += context->ptrCommonConfig->numSns * snsHistorySize;
                    if(NULL != ptrHistoryLowCh)
                    {
                        ptrHistoryLowCh += context->ptrCommonConfig->numSns;
                    }

                }

                if(CY_CAPSENSE_ENABLE == context->ptrCommonConfig->mfsEn)
                {
                    ptrSnsCxtSns = ptrWdCfg->ptrSnsContext;
                    for (snsIndex = ptrWdCfg->numSns; snsIndex-- > 0u;)
                    {
                        Cy_CapSense_RunMfsFiltering(ptrSnsCxtSns, context);
                        ptrSnsCxtSns++;
                    }
                }

                if (0u != (mode & CY_CAPSENSE_PROCESS_STATUS))
                {
                    Cy_CapSense_DpProcessCsdWidgetStatus(ptrWdCfg, context);
                }
                break;

            case (uint8_t)CY_CAPSENSE_SENSE_METHOD_CSX_E:

                /* Run the desired processing for the all CSX widget sensors */
                for(freqChIndex = 0u; freqChIndex < freqChNumber; freqChIndex++)
                {
                    ptrSnsCxtSns = ptrSnsCxtCh;
                    ptrHistorySns = ptrHistoryCh;
                    ptrHistoryLowSns = ptrHistoryLowCh;
                    for (snsIndex = 0uL; snsIndex < ptrWdCfg->numSns; snsIndex++)
                    {
                        result = Cy_CapSense_DpProcessCsxSensorRawCountsExt(ptrWdCfg, ptrSnsCxtSns, ptrHistorySns, ptrHistoryLowSns, mode, context);

                        ptrSnsCxtSns++;
                        ptrHistorySns += snsHistorySize;
                        if(NULL != ptrHistoryLowSns)
                        {
                            ptrHistoryLowSns++;
                        }

