dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/cy_capsense_control.c
                    }

                    ptrSnsCxtCh += context->ptrCommonConfig->numSns;
                    ptrHistoryCh += context->ptrCommonConfig->numSns * snsHistorySize;
                    if(NULL != ptrHistoryLowCh)
                    {
                        ptrHistoryLowCh += context->ptrCommonConfig->numSns;
                    }

                }

                if(CY_CAPSENSE_ENABLE == context->ptrCommonConfig->mfsEn)
                {
                    ptrSnsCxtSns = ptrWdCfg->ptrSnsContext;
                    for (snsIndex = ptrWdCfg->numSns; snsIndex-- > 0u;)
                    {
                        Cy_CapSense_RunMfsFiltering(ptrSnsCxtSns, context);
                        ptrSnsCxtSns++;
                    }
                }

                if (0u != (mode & CY_CAPSENSE_PROCESS_STATUS))
                {
                    Cy_CapSense_DpProcessCsxWidgetStatus(ptrWdCfg, context);
                }
                break;

        default:
            CY_ASSERT(0 != 0);
            break;
        }
    }
    return result;
}

/*******************************************************************************
* Function Name: Cy_CapSense_ProcessSensorExt
****************************************************************************//**
*
* Performs customized data processing on the selected widget's sensor.
*
* This function performs data processes for the specified sensor specified by
* the mode parameter. The execution order of the requested operations is from
* LSB to MSB of the mode parameter. For a different order, this
* function can be called multiple times with the required mode parameter.
*
* This function can be used with any of the available scan functions. This
* function is called only after a specified sensor in the widget is
* scanned. Calling this function multiple times with the same mode without
* sensor scanning causes unexpected behavior. This function ignores the value
* of the wdgtEnable register.
*
* The CY_CAPSENSE_PROCESS_CALC_NOISE and CY_CAPSENSE_PROCESS_THRESHOLDS 
* flags are supported by the CSD sensing method only when SmartSense is enabled.
*
* The pipeline scan method (i.e. during scanning of a sensor, processing
* of a previously scanned sensor is performed) can be implemented using this
* function and it may reduce the total scan/process time, increase the refresh
* rate, and decrease the power consumption.
*
* \param widgetId
* Specifies the ID number of a widget.
*
* \param sensorId
* Specifies the ID number of the sensor within the widget to process it.
*
* \param mode
* Specifies the type of the sensor processing that needs to be executed for the
* specified sensor:
* 1. Bits [31..5] - Reserved
* 2. Bits [4..0]  - CY_CAPSENSE_PROCESS_ALL - Executes all the tasks
* 3. Bit [4]      - CY_CAPSENSE_PROCESS_THRESHOLDS - Updates the thresholds 
*                   (only in auto-tuning mode)
* 4. Bit [3]      - CY_CAPSENSE_PROCESS_CALC_NOISE - Calculates the noise 
*                   (only in auto-tuning mode)
* 5. Bit [2]      - CY_CAPSENSE_PROCESS_DIFFCOUNTS - Updates the diffcount
* 6. Bit [1]      - CY_CAPSENSE_PROCESS_BASELINE - Updates the baseline
* 7. Bit [0]      - CY_CAPSENSE_PROCESS_FILTER - Runs the firmware filters
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the sensor process operation:
* - CY_RET_SUCCESS      - The processing is successfully performed.
* - CY_RET_BAD_PARAM    - The input parameter is invalid.
* - CY_RET_BAD_DATA     - The processing failed.
*
*******************************************************************************/
cy_status Cy_CapSense_ProcessSensorExt(
                uint32_t widgetId, 
                uint32_t sensorId, 
                uint32_t mode, 
                const cy_stc_capsense_context_t * context)
{
    cy_status result = CY_RET_BAD_PARAM;

    uint32_t freqChIndex;
    uint32_t freqChNumber;
    uint32_t snsHistorySize;
    uint32_t cxtOffset;
    uint32_t historyOffset;

    uint16_t * ptrHistory;
    uint8_t  * ptrHistoryLow = NULL;
    const cy_stc_capsense_widget_config_t * ptrWdCfg;
    cy_stc_capsense_sensor_context_t * ptrSnsCxt;

    if (widgetId < context->ptrCommonConfig->numWd)
    {
        ptrWdCfg = &context->ptrWdConfig[widgetId];
        if (sensorId < ptrWdCfg->numSns)
        {
            snsHistorySize = (uint32_t)ptrWdCfg->rawFilterConfig & CY_CAPSENSE_RC_FILTER_SNS_HISTORY_SIZE_MASK;
            freqChNumber = (CY_CAPSENSE_ENABLE == context->ptrCommonConfig->mfsEn) ? 3u : 1u;
            ptrHistory = &ptrWdCfg->ptrRawFilterHistory[sensorId * snsHistorySize];
            if((uint32_t)CY_CAPSENSE_IIR_FILTER_PERFORMANCE == ((uint32_t)ptrWdCfg->rawFilterConfig & (uint32_t)CY_CAPSENSE_RC_FILTER_IIR_MODE_MASK))
            {
                ptrHistoryLow =  &ptrWdCfg->ptrRawFilterHistoryLow[sensorId];
            }
        
            ptrSnsCxt = &ptrWdCfg->ptrSnsContext[sensorId];
            cxtOffset = context->ptrCommonConfig->numSns;
            historyOffset = snsHistorySize * context->ptrCommonConfig->numSns;
            
            switch(ptrWdCfg->senseMethod)
            {
                case (uint8_t)CY_CAPSENSE_SENSE_METHOD_CSD_E:
                    for(freqChIndex = 0u; freqChIndex < freqChNumber; freqChIndex++)
                    {
                        result = Cy_CapSense_DpProcessCsdSensorRawCountsExt(
                                                ptrWdCfg,
                                                ptrSnsCxt, 
                                                ptrHistory,
                                                ptrHistoryLow,
                                                mode, context);
                        ptrSnsCxt += cxtOffset;
                        ptrHistory += historyOffset;
                        ptrHistoryLow += cxtOffset;
                    }
                    break;

                case (uint8_t)CY_CAPSENSE_SENSE_METHOD_CSX_E:
                    for(freqChIndex = 0u; freqChIndex < freqChNumber; freqChIndex++)
                    {    
                        result = Cy_CapSense_DpProcessCsxSensorRawCountsExt(
                                                ptrWdCfg,
                                                ptrSnsCxt, 
                                                ptrHistory,
                                                ptrHistoryLow,
                                                mode, context);
                        ptrSnsCxt += cxtOffset;
                        ptrHistory += historyOffset;
                        ptrHistoryLow += cxtOffset;                        
                    }
                    break;

                default:
                    CY_ASSERT(0 != 0);
                    break;
            }

            if(CY_CAPSENSE_ENABLE == context->ptrCommonConfig->mfsEn)
            {
                ptrSnsCxt = ptrWdCfg->ptrSnsContext;
                Cy_CapSense_RunMfsFiltering(ptrSnsCxt, context);
            }
            
