dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/cy_capsense_control.c
            result = CY_RET_SUCCESS;
        }
    }
    return result;
}


/*******************************************************************************
* Function Name: Cy_CapSense_Wakeup
****************************************************************************//**
*
* Resumes the middleware after Deep Sleep.
*
* This function is used to resume the middleware after exiting Deep Sleep. In 
* Deep Sleep power mode, the CSD HW is powered off and an extra delay is required 
* to establish correct operation of HW.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_Wakeup(const cy_stc_capsense_context_t * context)
{
    Cy_SysLib_DelayUs((uint16_t)context->ptrCommonConfig->analogWakeupDelay);
}


/*******************************************************************************
* Function Name: Cy_CapSense_DeepSleepCallback
****************************************************************************//**
*
* Handles Active to Deep Sleep power mode transition for the CapSense
* middleware.
*
* Calling this function directly from the application layer is not recommended.
* Instead, Cy_SysPm_DeepSleep() should be used for the Active to Deep Sleep
* power mode transition of the device.
*
* For proper operation of the CapSense middleware during the Active to
* Deep Sleep mode transition, a callback to this function should be registered
* using the Cy_SysPm_RegisterCallback() function with CY_SYSPM_DEEPSLEEP
* type. After the callback is registered, this function is called by the
* Cy_SysPm_DeepSleep() function to prepare the middleware to the device
* power mode transition.
*
* When this function is called with CY_SYSPM_CHECK_READY as input, this
* function returns CY_SYSPM_SUCCESS if no scanning is in progress. Otherwise
* CY_SYSPM_FAIL is returned. If CY_SYSPM_FAIL status is returned, a device
* cannot change the power mode without completing the current scan as
* a transition to Deep Sleep during the scan can disrupt the middleware
* operation.
*
* \param callbackParams
* Refer to the description of the cy_stc_syspm_callback_params_t type in the
* Peripheral Driver Library documentation.
*
* \param mode
* Specifies mode cy_en_syspm_callback_mode_t.
*
* \return
* Returns the status cy_en_syspm_status_t of the operation requested 
* by the mode parameter:
* - CY_SYSPM_SUCCESS  - Deep Sleep power mode can be entered.
* - CY_SYSPM_FAIL     - Deep Sleep power mode cannot be entered.
*
*******************************************************************************/
cy_en_syspm_status_t Cy_CapSense_DeepSleepCallback(
                cy_stc_syspm_callback_params_t * callbackParams, 
                cy_en_syspm_callback_mode_t mode)
{
    cy_en_syspm_status_t retVal = CY_SYSPM_SUCCESS;
    cy_en_csd_key_t mwKey;
    cy_stc_capsense_context_t * capsenseCxt = (cy_stc_capsense_context_t *)callbackParams->context;

    if (CY_SYSPM_CHECK_READY == mode)
    {
        mwKey = Cy_CSD_GetLockStatus(capsenseCxt->ptrCommonConfig->ptrCsdBase, capsenseCxt->ptrCommonConfig->ptrCsdContext);

        if (CY_CSD_CAPSENSE_KEY == mwKey)
        {
            if (CY_CAPSENSE_NOT_BUSY != Cy_CapSense_IsBusy(capsenseCxt))
            {
                retVal = CY_SYSPM_FAIL;
            }
        }
    }

    return(retVal);
}


/*******************************************************************************
* Function Name: Cy_CapSense_IncrementGestureTimestamp
****************************************************************************//**
*
* Increases the timestamp register for the predefined timestamp interval.
*
* This function increments the timestamp by the interval specified
* in the context->ptrCommonContext->timestampInterval register. The unit for
* both parameters is milliseconds and default value of the interval is 1.
*
* The application layer must periodically call this
* function or register a periodic callback to this function to keep the
* timestamp updated and operational, which is vital for the
* operation of Gesture and Ballistic multiplier features.
*
* The timestamp can be updated in one of the three methods:
* - Register a periodic callback for the
*   Cy_CapSense_IncrementGestureTimestamp() function.
* - Periodically call the Cy_CapSense_IncrementGestureTimestamp() function
*   from the application layer.
* - Directly modify the timestamp using the
*   Cy_CapSense_SetGestureTimestamp() function.
*
* The interval at which this function is called should match with interval
* defined in context->ptrCommonContext->timestampInterval register. Either the
* register value can be updated to match the callback interval or the callback
* can be made at interval set in the register.
*
* If a timestamp is available from another source or from the Host controller,
* the application layer may choose to periodically update the timestamp
* by using Cy_CapSense_SetGestureTimestamp() function instead of
* registering a callback.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_IncrementGestureTimestamp(cy_stc_capsense_context_t * context)
{
    context->ptrCommonContext->timestamp += 
                context->ptrCommonContext->timestampInterval;
}


/*******************************************************************************
* Function Name: Cy_CapSense_SetGestureTimestamp
****************************************************************************//**
*
* Rewrites the timestamp register by the specified value.
*
* This function writes the specified value into the middleware timestamp 
* context->ptrCommonContext->timestamp register.
*
* If a timestamp is available from another source or from the Host controller,
* the application layer may choose to periodically update the timestamp
* by using this function instead of registering a callback.
*
* Do not modify the timestamp arbitrarily or
* simultaneously use with the Cy_CapSense_IncrementGestureTimestamp()
* function.
*
* \param value
* Specifies the timestamp value (in ms).
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_SetGestureTimestamp(
                uint32_t value, 
                cy_stc_capsense_context_t * context)
{
    context->ptrCommonContext->timestamp = value;
}


