dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/cy_capsense_control.c
/*******************************************************************************
* Function Name: Cy_CapSense_Restore
****************************************************************************//**
*
* Resumes the middleware operation if the Cy_CapSense_Save() function was
* called previously.
*
* This function performs a sub-set of initialization task to restore CapSense
* after underlying hardware are used by another middleware.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the resume process. If CY_RET_SUCCESS is not received,
* the resume process fails and retries may be required.
*
*******************************************************************************/
cy_status Cy_CapSense_Restore(cy_stc_capsense_context_t * context)
{
    uint32_t cpuFreqMHz;
    uint32_t watchdogCounter;

    cy_en_csd_key_t mvKey;
    cy_status result = CY_RET_INVALID_STATE;
    cy_en_csd_status_t csdHwStatus = CY_CSD_SUCCESS;
    cy_stc_csd_context_t * ptrCsdCxt = context->ptrCommonConfig->ptrCsdContext;
    CSD_Type * ptrCsdBaseAdd = context->ptrCommonConfig->ptrCsdBase;

    /* Approximate duration of Wait For Init loop */
    const uint32_t intrInitLoopDuration = 5uL;

    /* Wait For Init watchdog timeout in microseconds */
    const uint32_t initWatchdogTimeUs = 1000000uL;

    /* Get CSD HW block status */
    mvKey = Cy_CSD_GetLockStatus(ptrCsdBaseAdd, ptrCsdCxt);
    if(CY_CSD_NONE_KEY == mvKey)
    {
        csdHwStatus = Cy_CSD_GetConversionStatus(ptrCsdBaseAdd, ptrCsdCxt);
        if(CY_CSD_BUSY == csdHwStatus)
        {
            Cy_CSD_WriteReg(context->ptrCommonConfig->ptrCsdBase, CY_CSD_REG_OFFSET_INTR_MASK, CY_CAPSENSE_CSD_INTR_MASK_CLEAR_MSK);
            Cy_CSD_WriteReg(context->ptrCommonConfig->ptrCsdBase, CY_CSD_REG_OFFSET_SEQ_START, CY_CAPSENSE_CSD_SEQ_START_ABORT_MSK);

            /* Init Watchdog Counter to prevent a hang */
            cpuFreqMHz = context->ptrCommonConfig->cpuClkHz / 1000000uL;
            watchdogCounter = Cy_CapSense_WatchdogCyclesNum(initWatchdogTimeUs, cpuFreqMHz, intrInitLoopDuration);
            while((CY_CSD_BUSY == csdHwStatus) && (0uL != watchdogCounter))
            {
                csdHwStatus = Cy_CSD_GetConversionStatus(ptrCsdBaseAdd, ptrCsdCxt);
                watchdogCounter--;
            }
        }

        if(CY_CSD_SUCCESS == csdHwStatus)
        {
            csdHwStatus = Cy_CSD_Init(
                                ptrCsdBaseAdd, 
                                &cy_capsense_csdCfg, 
                                CY_CSD_CAPSENSE_KEY, 
                                ptrCsdCxt);
            result = CY_RET_SUCCESS;
        }
        
    }
    return (result);
}


/*******************************************************************************
* Function Name: Cy_CapSense_Save
****************************************************************************//**
*
* Saves the state of CapSense so the functionality can be restored
* using Cy_CapSense_Restore() function.
*
* When different functionality of the CSD block is required, this function is  
* used to switch the CSD block assignment between different middleware in 
* time-multiplexed mode. 
* This function performs the following operations:
* - Release CSD hardware block.
* - Configure sensor pins to the default state and disconnect them from 
*   analog buses.
* - Disconnect external capacitors from analog buses.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the process. If CY_RET_SUCCESS is not received,
* the save process fails and retries may be required.
*
*******************************************************************************/
cy_status Cy_CapSense_Save(cy_stc_capsense_context_t * context)
{
    cy_status result = CY_RET_INVALID_STATE;
    cy_en_csd_status_t initStatus = CY_CSD_LOCKED;

    if (CY_CAPSENSE_SW_STS_BUSY != Cy_CapSense_IsBusy(context))
    {
        /* Disconnect external capacitors and sensor pins from analog bus */
        Cy_CapSense_SwitchSensingMode((uint8_t)CY_CAPSENSE_UNDEFINED_E, context);

        /* Release HW CSD block */
        initStatus = Cy_CSD_DeInit(
                        context->ptrCommonConfig->ptrCsdBase, 
                        CY_CSD_CAPSENSE_KEY, 
                        context->ptrCommonConfig->ptrCsdContext);

        if (CY_CSD_SUCCESS == initStatus)
        {
            result = CY_RET_SUCCESS;

        }
    }

    return result;
}


/*******************************************************************************
* Function Name: Cy_CapSense_RegisterCallback
****************************************************************************//**
*
* Registers a callback function, which notifies that
* \ref cy_en_capsense_callback_event_t occurred in the CapSense middleware.
*
* \param callbackType
* The registered callback will be triggered with the CapSense middleware execution event.
* Refer to \ref cy_en_capsense_callback_event_t for the list of
* supported events.
*
* \param callbackFunction
* The pointer to the callback function.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the sensor process operation:
* - CY_RET_SUCCESS      - The processing performed successfully.
* - CY_RET_BAD_PARAM    - The input parameter is invalid.
*
*******************************************************************************/
cy_status Cy_CapSense_RegisterCallback(
                cy_en_capsense_callback_event_t callbackType,
                cy_capsense_callback_t callbackFunction,
                cy_stc_capsense_context_t * context)
{
    cy_status retVal = CY_RET_SUCCESS;
        
    if((NULL != callbackFunction) && (NULL != context))
    {
        switch(callbackType)
        {
            case CY_CAPSENSE_START_SAMPLE_E:
                context->ptrCommonContext->ptrSSCallback = callbackFunction;
                break;
            case CY_CAPSENSE_END_OF_SCAN_E:
                context->ptrCommonContext->ptrEOSCallback = callbackFunction;
                break;
            default:
                retVal = CY_RET_BAD_PARAM;
                break;
        }
    }
    else
    {
        retVal = CY_RET_BAD_PARAM;
    }

