dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/cy_capsense_control.c
    return(retVal);
}


/*******************************************************************************
* Function Name: Cy_CapSense_UnRegisterCallback
****************************************************************************//**
*
* This function unregisters the CapSense middleware callbacks.
*
* \param callbackType
* The registered callback will be triggered with the CapSense middleware execution event. 
* Refer to \ref cy_en_capsense_callback_event_t for the list of
* supported events.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the sensor process operation:
* - CY_RET_SUCCESS      - The processing performed successfully.
* - CY_RET_BAD_PARAM    - The input parameter is invalid.
*
*******************************************************************************/
cy_status Cy_CapSense_UnRegisterCallback(
                cy_en_capsense_callback_event_t callbackType,
                cy_stc_capsense_context_t * context)
{
    cy_status retVal = CY_RET_SUCCESS;
        
    if(NULL != context)
    {
        switch(callbackType)
        {
            case CY_CAPSENSE_START_SAMPLE_E:
                context->ptrCommonContext->ptrSSCallback = NULL;
                break;
            case CY_CAPSENSE_END_OF_SCAN_E:
                context->ptrCommonContext->ptrEOSCallback = NULL;
                break;
            default:
                retVal = CY_RET_BAD_PARAM;
                break;
        }
    }
    else
    {
        retVal = CY_RET_BAD_PARAM;
    }

    return(retVal);

}


/* [] END OF FILE */
